Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G67A.tmx
Source language: en_us
Languages: zh_cn

source: Why I have to leave Israel
zh_cn: 我为什么要离开以色列

source: Quite soon I am going away from here.
zh_cn: 很快我就要离开这里。

source: In a few days we'll be leaving Jerusalem, leaving the country.
zh_cn: 几天之后我们就会离开耶路撒冷，离开这个国家。

source: Yesterday we bought little suitcases for the kids.
zh_cn: 昨天我和孩子们买了几个行李箱。

source: No need to take a lot of clothes, we'll leave our winter clothes; in any event they won't be warm enough given the cold of southern Illinois, USA.
zh_cn: 我们不需要带很多的衣服，把冬天的衣服留下，因为考虑到美国伊利诺斯州南部的寒冷度，这些衣服怎么说也是不够暖的。

source: We'll just need a few things until we get settled.
zh_cn: 我们只需要一点东西足够安定下来就可以了。

source: Perhaps the kids should take some books, two or three in Arabic, and another few in Hebrew, so they don't forget the languages.
zh_cn: 可能孩子们会需要一些书，两三本阿拉伯语的和几本希伯来语的，这样他们就不会忘记他们的母语。

source: But I'm already not sure what I want my kids to remember of this place, so beloved and so cursed.
zh_cn: 不过我也不知道自己究竟想他们对这个让人爱憎交织的地方怀有何样的记忆。

source: The original plan was to leave in a month for a year's sabbatical.
zh_cn: 我们原来的计划是趁轮休年离开一个月。

source: But last week I understood that I can't stay here any longer, and I asked the travel agent to get us out of here as fast as possible, "and please make them one-way tickets".
zh_cn: 但是上周我明白我不能再留在这个地方了，于是我去旅行社要他们尽快把我们送走，“请一定要只是单程的”。

source: In a few days we'll land in Chicago, and I don't even know where we'll be for the first month, but we'll figure it out.
zh_cn: 几天后我们会降落在芝加哥，我也不知道头一个月里我们会去哪里，不过我们会想出办法来的。

source: I have three children, a daughter who is already 14 years old, and two sons, aged nine and three.
zh_cn: 我有三个孩子，女孩已经14岁，两个男孩分别是九岁和三岁。

source: We live in West Jerusalem. We are the only Arab family living in our neighbourhood, to which we moved six years ago.
zh_cn: 六年前我们搬到了现在住的西耶路撒冷，我们是邻近一带唯一的阿拉伯人。

source: "You can choose two toys," we said this week in Hebrew to our little boy who stood in his room gazing at boxes of his toys, and he started to cry despite our promises that we will buy him anything he wants when we get there.
zh_cn: “你可以选两个玩具”，这个星期的某天我和小儿子用希伯来语对话，他站在房间里注视着他的玩具箱，他哭了起来，完全不顾我们对他的承诺，一到美国我们会给他买一切他想要的。

source: I also have to decide what to take.
zh_cn: 我也要决定带什么走。

source: I can choose only two books, I said to myself standing in front of shelves of books in my study.
zh_cn: 我站在书房的书架前对自己说，只可以选两本书。

source: Other than a book of poetry by [Mahmoud Darwish](http://www.theguardian.com/books/2008/aug/11/poetr y.israelandthepalestinians) and another story collection by Jubran Khalil, all of my books are in Hebrew.
zh_cn: 除了一本Mahmoud Darwish写的诗集和一本Jubran Khalil的故事集，我的书都是用希伯来语写的。

source: Since the age of 14 I have barely read a book in Arabic.
zh_cn: 从14岁开始我就几乎没有读过一本阿拉伯语的书。

source: When I was 14 I saw a library for the first time.
zh_cn: 14岁那年我第一次见到图书馆。

source: Twenty-five years ago my maths teacher in the village of Tira, where I was born, came to my parents' home and told them that next year the Jews would be opening a school for gifted students in Jerusalem.
zh_cn: 25年前，在我出生地提拉村，我的数学老师走到我家跟我的父母说，犹太人明年将在耶路撒冷为有天分的学生开设学校。

source: He said to my father that he thought I should apply.
zh_cn: 他告诉我的父亲我可以去申请试一下。

source: "It will be better for him there," I remember the teacher telling my parents.
zh_cn: “那里对他来说更好一些”，我记得我的老师是这样告诉他们的。

source: I got in, and when I was the age of my daughter I left my home to go to a Jewish boarding school in Jerusalem.
zh_cn: 我入学了，在我女儿这个年龄时，我离开我的家乡去到一个在耶路撒冷的犹太寄宿学校。

source: It was so difficult, almost cruel.
zh_cn: 这是很难的，甚至是残忍的。

source: I cried when my father hugged me and left me at the entrance of the grand new school, nothing like I had ever seen in Tira.
zh_cn: 父亲在崭新的学校大门抱住我然后扔下我离开了，我哭了起来，这里和我在提拉见到的全都不一样。

source: I once wrote that the first week in Jerusalem was the hardest week of my life.
zh_cn: 我曾经写过说在耶路撒冷的第一个星期是我人生中最困难的一周。

source: I was different, other; my clothes were different, as was my language.
zh_cn: 我和其他人不一样，是个异类。我的着装不一样，我的语言也一样。

source: All of the classes were in Hebrew ¨C science, bible, literature.
zh_cn: 所有的课都是用希伯来语教的——科学、圣经和文学。

source: I sat there not understanding one word.
zh_cn: 我坐在那里一个字都没听懂。

source: When I tried to speak everyone would laugh at me.
zh_cn: 每当我尝试说他们的话他们就会嘲笑我。

source: I so much wanted to run back home, to my family, to the village and friends, to the Arabic language.
zh_cn: 我恨不得跑回家去，回到我的家人那里，回到村庄和朋友那里，回到阿拉伯语中。

source: I cried on the phone to my father that he should come and get me, and he said that only the beginnings are hard, that in a few months I would speak Hebrew better than they do.
zh_cn: 我打电话给父亲哭诉要他来接我回去，他告诉我万事开头难，不用几个月我的希伯来语肯定比他们的还要好。

source: I remember the first week, our literature teacher asked us to read The Catcher in the Rye by Salinger.
zh_cn: 我记得第一个星期里，我们的文学老师要我们读塞林格的《麦田里的守望者》。

source: It was the first novel I ever read. It took me several weeks to read it, and when I finished I understood two things that changed my life.
zh_cn: 这是我读的第一本小说，我花了好几个星期才读完，读完之后我意识到两样将改变我生命的东西。

source: The first was that I could read a book in Hebrew, and the second was the deep understanding that I loved books.
zh_cn: 第一样是我可以读希伯来语的书，第二就是我深刻感受到我热爱读书。

source: Very quickly my Hebrew became nearly perfect.
zh_cn: 很快我就完全学会了希伯来语。

source: The boarding school library only had books in Hebrew, so I began to read Israeli authors.
zh_cn: 寄宿学校了里只有希伯来语的书，于是我开始阅读一些以色列作家的书。

source: I read Agnon, Meir Shalev, Amos Oz and I started to read about Zionism, about Judaism and the building of the homeland.
zh_cn: 我读了阿格农，梅厄·沙莱夫和阿摩斯·奥兹，我还看了一些关于锡安主义、犹太主义以及家乡建筑的书。

source: During these years I also began to understand my own story, and without planning to do so I began to write about Arabs who live in an Israeli boarding school, in the western city, in a Jewish country.
zh_cn: 在那几年里我也开始明白了我自己的故事，在没有计划的情况下，我开始写一个在以色列寄宿学校的阿拉伯学生的故事，他住在犹太国家里的西部城市里。

source: I began to write, believing that all I had to do to change things would be to write the other side, to tell the stories that I heard from my grandmother.
zh_cn: 随着我开始写，我越来越坚信我要做的来改变一些事情的是去写另一方面的，我要告诉世人我从祖母那里听来的故事。

source: To write how my grandfather was killed in the battle over Tira in 1948, how my grandmother lost all of our land, how she raised my father while she supported them as a fruit picker paid by the Jews.
zh_cn: 我要写我祖父是如何死于1948年的提拉战役中的，我的祖母是如何失去所有土地的，她又是如何通过作为犹太人雇佣的摘果农来抚养带大我的父亲的。

source: I wanted to tell, in Hebrew, about my father who sat in jail for long years, with no trial, for his political ideas.
zh_cn: 我想用希伯来语告诉世人我的父亲遭遇的多年牢狱之灾，没有审判，而只是因为他的政治理想。

source: I wanted to tell the Israelis a story, the Palestinian story.
zh_cn: 我想告诉以色列人一个故事，一个关于巴勒斯坦的故事。

source: Surely when they read it they will understand, when they read it they will change, all I have to do is write and the Occupation will end.
zh_cn: 我肯定只要他们读了他们就会理解，他们就会改变，我要做的就是写作，侵略就会终结。

source: I just have to be a good writer and I will free my people from the ghettos they live in, tell good stories in Hebrew and I will be safe, another book, another movie, another newspaper column and another script for television and my children will have a better future.
zh_cn: 我只需要做一个好作家，我就可以从犹太区解放我的同胞，用希伯来语说一些好故事我就会安全，再出第二本书，第二部电影，新的报纸专栏和电视剧本，我的孩子也会有一个更好的未来。

source: Thanks to my stories one day we will turn into equal citizens, almost like the Jews.
zh_cn: 因为我的故事有一天我们会变成平等的市民，就和犹太人一样。

source: Twenty-five years of writing in Hebrew, and nothing has changed.
zh_cn: 然而我25年的希伯来语写作生涯并没有带来任何的改变。

source: Twenty-five years clutching at the hope, believing it is not possible that people can be so blind.
zh_cn: 25年来我死死抓住的信念，坚信人们不可能都是瞎子。

source: Twenty-five years during which I had few reasons to be optimistic but continued to believe that one day this place in which both Jews and Arabs live together would be the one story where the story of the other is not denied.
zh_cn: 25年来，缺少让我积极的理由，但是我仍然相信总有一天，犹太人和阿拉伯人共同居住的这个地方，会是同一个故事，在故事里其中一方的故事不会被另一方所否认。

source: That one day the Israelis would stop denying the Nakba, the Occupation, and the suffering of the Palestinian people.
zh_cn: 总有一天以色列人不再否认灾难日、侵占和巴勒斯坦人所遭受的苦难。

source: That one day the Palestinians would be willing to forgive and together we would build a place that was worth living in.
zh_cn: 总有一天，巴勒斯坦人会主动宽恕，我们会共同建立一个值得一起居住的家园。

source: Twenty-five years that I am writing and knowing bitter criticism from both sides, but last week I gave up.
zh_cn: 25年来，我一直在写作，理解到来自两边的猛烈的抨击，但是上星期我放弃了。

source: Last week something inside of me broke.
zh_cn: 上个星期我内心的一些信念破灭了。

source: When Jewish youth parade through the city shouting "Death to the Arabs," and attack Arabs only because they are Arabs, I understood that I had lost my little war.
zh_cn: 当犹太青年在城市里游行时，他们叫喊着“杀死阿拉伯人”，而且仅仅因为他们是阿拉伯人而攻击阿拉伯人，我明白到我的小战役已经输了。

source: I listened to the politicians and the media and I know that they are differentiating between blood and blood, between peoples.
zh_cn: 但是当我听到政客和媒体说的，我知道他们在用血统和人种来进行区分。

source: Those who have become the powers that be say expressly what most Israelis think, "We are a better people than the Arabs."
zh_cn: 那些获得了权力的人说的就是绝大多数以色列人所想的，“我们是比阿拉伯人优秀的人”。

source: On panels that I participated in, it was said that Jews are a superior people, more entitled to life.
zh_cn: 在我参加的座谈小组里，他们都说犹太人是一个高等民族，更有资格生存下去。

source: I despair to know that an absolute majority in the country does not recognise the rights of an Arab to live.
zh_cn: 我绝望地认识到这个国家的大部分人是不承认阿拉伯人有生存下去的权力的。

source: After my last columns some readers beseeched that I be exiled to Gaza, threatened to break my legs, to kidnap my children.
zh_cn: 我写了我最后一个专栏故事后，有些读者要求把我驱逐到加沙，恐吓说要打断我的腿，绑架我的孩子。

source: I live in Jerusalem, and I have some wonderful Jewish neighbours, and friends, but I still cannot take my children to day camps or to parks with their Jewish friends.
zh_cn: 我住在耶路撒冷，我还有几个了不起的邻居和朋友，但是我还是不能让我的孩子单独和他的犹太朋友去露营或者去公园玩。

source: My daughter protested furiously and said no one would know she is an Arab because of her perfect Hebrew but I would not listen.
zh_cn: 我的女儿极度反抗并说没有人会知道她是阿拉伯人，她的希伯来语说的很好，但我不会听从她的话。

source: She shut herself in her room and wept.
zh_cn: 她把自己关在房间里哭了起来。

source: Now I am standing in front of my bookshelves, Salinger in hand, the one I read 14 years ago.
zh_cn: 此刻我站在我的书架前，手里拿着塞林格，我14年前读的那本书。

source: I don't want to take any books, I decided, I have to concentrate on my new language.
zh_cn: 我不想再拿别的书了，我决定，我必须专心学我的新语言。

source: I know how hard it is, almost impossible, but I must find another language to write in, my children will have to find another language to live in.
zh_cn: 我知道这有多么的难，几乎是不可能的，但是我必须找到另一种语言来继续写作下去，我的孩子们也要找到另一种语言来生活下去。

source: "Don't come in," my daughter shouted angrily when I knocked on her door.
zh_cn: “不要进来！”我敲女儿的门时她生气地吼道。

source: I went in anyway.
zh_cn: 不过我还是进去了。

source: I sat down next to her on the bed and despite her back turned to me I knew she was listening.
zh_cn: 我靠着她坐到床沿，不管她用背对着我，我知道她在听。

source: You hear, I said, before I repeated to her exactly the same sentence my father said to me 25 years ago. "Remember, whatever you do in life, for them you will always, but always, be an Arab. Do you understand?"
zh_cn: 在我把我父亲25年前对我说的同一句话说给我的女儿之前，读者你已经听过了，我说，“记住，无论你这辈子做什么都好，对他们来说，你永远，永远都是阿拉伯人，明白吗？”

source: "I understand," my daughter said, hugging me tightly. "Dad, I knew that a long time ago."
zh_cn: “我明白。”女儿说，她紧紧的抱住我，“爸爸，我早就知道了。”

source: "Quite soon we'll be leaving here," as I messed up her hair, just as she hates.
zh_cn: “很快我们就会离开这里”，我一边说一边盘起她的头发，她最讨厌我这样做了。

source: "Meanwhile, read this," I said and gave her The Catcher in the Rye.
zh_cn: “与此同时，读一读这本书”，我说，把《麦田的守望者》递给了她。
